pipeline/openfoam/cases/mcl39-baseline/system/blockMeshDict
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object blockMeshDict;
}

convertToMeters 1;

vertices
(
  (-8 -4 0)
  (16 -4 0)
  (16 4 0)
  (-8 4 0)
  (-8 -4 4.8)
  (16 -4 4.8)
  (16 4 4.8)
  (-8 4 4.8)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (140 48 36) simpleGrading (1 1 1)
);

edges
(
);

boundary
{
  inlet
  {
    type patch;
    faces
    (
      (0 4 7 3)
    );
  }

  outlet
  {
    type patch;
    faces
    (
      (1 2 6 5)
    );
  }

  sides
  {
    type patch;
    faces
    (
      (0 1 5 4)
      (3 7 6 2)
    );
  }

  top
  {
    type patch;
    faces
    (
      (4 5 6 7)
    );
  }

  ground
  {
    type wall;
    faces
    (
      (0 3 2 1)
    );
  }
}

mergePatchPairs
(
);
