pipeline/openfoam/cases/mcl39-baseline/0/U
FoamFile
{
  version 2.0;
  format ascii;
  class volVectorField;
  object U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform (15 0 0);

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform (15 0 0);
  }

  outlet
  {
    type inletOutlet;
    inletValue uniform (15 0 0);
    value uniform (15 0 0);
  }

  sides
  {
    type slip;
  }

  top
  {
    type slip;
  }

  ground
  {
    type movingWallVelocity;
    value uniform (15 0 0);
  }

  car
  {
    type noSlip;
  }
}
