pipeline/openfoam/cases/mcl39-baseline/0/omega
FoamFile
{
  version 2.0;
  format ascii;
  class volScalarField;
  object omega;
}

dimensions [0 0 -1 0 0 0 0];

internalField uniform 20;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 20;
  }

  outlet
  {
    type inletOutlet;
    inletValue uniform 20;
    value uniform 20;
  }

  sides
  {
    type zeroGradient;
  }

  top
  {
    type zeroGradient;
  }

  ground
  {
    type omegaWallFunction;
    value uniform 20;
  }

  car
  {
    type omegaWallFunction;
    value uniform 20;
  }
}
