pipeline/openfoam/cases/mcl39-baseline/system/fvSchemes
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object fvSchemes;
}

ddtSchemes
{
  default steadyState;
}

gradSchemes
{
  default Gauss linear;
  grad(U) cellLimited Gauss linear 1;
}

divSchemes
{
  default none;
  div(phi,U) bounded Gauss linearUpwind grad(U);
  div(phi,k) bounded Gauss upwind;
  div(phi,omega) bounded Gauss upwind;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
  default Gauss linear corrected;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

wallDist
{
  method meshWave;
}
