pipeline/openfoam/cases/mcl39-baseline/system/fvSolution
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object fvSolution;
}

solvers
{
  p
  {
    solver GAMG;
    tolerance 1e-7;
    relTol 0.01;
    smoother GaussSeidel;
  }

  U
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-8;
    relTol 0.1;
  }

  "(k|omega|nut)"
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-8;
    relTol 0.1;
  }
}

SIMPLE
{
  nNonOrthogonalCorrectors 1;
  consistent yes;

  residualControl
  {
    p 1e-4;
    U 1e-5;
    "(k|omega)" 1e-5;
  }
}

relaxationFactors
{
  fields
  {
    p 0.3;
  }

  equations
  {
    U 0.7;
    k 0.7;
    omega 0.7;
  }
}
