pipeline/openfoam/cases/mcl39-baseline/system/surfaceFeatureExtractDict
FoamFile
{
  version 2.0;
  format ascii;
  class dictionary;
  object surfaceFeatureExtractDict;
}

mcl39_clean.stl
{
  extractionMethod extractFromSurface;
  includedAngle 150;
  writeObj yes;
}
